<template>
<client-only>
    <v-main class="v-rules">
        <v-container>
            <v-row>
                <v-col cols="12" md="3">
                    <generalRulesMenu />
                </v-col>
                <v-col cols="12" md="9">
                    <generalRulesContent :content="content" title="قوانین عمومی" />
                </v-col>
            </v-row>
        </v-container>
    </v-main>
</client-only>
</template>

<script>
export default {
    data() {
        return {
            content: "ورود کاربران به وب‏‌سایت شاواز هنگام استفاده از پروفایل شخصی، طرح‏‌های تشویقی، ویدئوهای رسانه تصویری شاواز و سایر خدمات ارائه شده توسط شاواز به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه استفاده از سرویس‌‏ها و خدمات شاواز است. توجه داشته باشید که ثبت سفارش نیز در هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین شاواز از سوی کاربر است. لازم به ذکر است شرایط و قوانین مندرج، جایگزین کلیه توافق‏‌های قبلی محسوب می‏‌شود. <br>توجه داشته باشید کلیه اصول و رویه‏‌های شاواز منطبق با قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است و متعاقبا کاربر نیز موظف به رعایت قوانین مرتبط با کاربر است. در صورتی که در قوانین مندرج، رویه‏‌ها و سرویس‏‌های شاواز تغییراتی در آینده ایجاد شود، در همین صفحه منتشر و به روز رسانی می شود و شما توافق می‏‌کنید که استفاده مستمر شما از سایت به معنی پذیرش هرگونه تغییر است.<br>یکی دیگر از ویژگی‌های منحصر به فرد فروشگاه اینترنتی شاواز تخفیف روزانه در قالب استند، حراج‌های هفتگی و ماهیانه و انواعی از پیشنهادهای ویژه است که در نهایت خرید اینترنتی را برای شما بسیار لذت ‌بخش‌تر خواهد کرد."
        }
    },

    setup() {
        const title = ref('فروشگاه اینترنتی شاواز | قوانین عمومی')
        const description = ref("بخش قوانی شاواز ، قوانین عمومی شاواز ")

        useHead({
            title,
            meta: [{
                name: 'description',
                content: description
            }]
        })
    },
}
</script>

<style>
@import '~/assets/scss/views/rules.scss';
</style>
