<template>
<client-only>
    <v-main class="v-rules">
        <v-container>
            <v-row>
                <v-col cols="12" md="3">
                    <generalRulesMenu />
                </v-col>
                <v-col cols="12" md="9">
                    <generalRulesContent :content="content" title="حقوق اداره کار" />
                </v-col>
            </v-row>
        </v-container>
    </v-main>
</client-only>
</template>

<script>
export default {
    data() {
        return {
            content: "سایت شاواز ممکن است دارای لینک‏‌هایی به سایت‌های دیگر باشد. این سایت‏‌ها تحت کنترل شاواز نیستند و سایت شاواز هیچ مسوولیتی در قبال محتویات این سایت‏‌ها شامل (و نه محدود به) لینک‏‌های دیگری که ممکن است در این سایت‏‌ها باشد ندارد. سایت شاواز این لینک‏‌ها را برای سهولت شما فراهم کرده است و وجود هر یک از این لینک‏‌ها به معنی تائید یا هر نوع ارتباط ما با اداره کنندگان آنها نیست. سایت‏‌هایى که در آگهی‏‌ها یا صفحه‏‌های سایت شاواز لینک می‏‌شوند را افرادی خارج از شاواز اداره می‌کنند، بنابراین سایت شاواز نمی‌‏تواند در مورد آنها ضمانتى داشته باشد. شما توافق می‏‌کنید مسوولیت هر گونه خسارت و آسیب احتمالی وارده را از طرﻳﻖ وﻳﺮوس یا فایل‏‌های مخرب دیگر که می‌تواند ناشی از درﻳﺎفت و استفاده از داده‌‏ها و فایل‏‌های متعلق به سایت‏‌های لینک شده در سایت شاواز باشد، خود برعهده خواهید داشت."
        }
    },

    setup() {
        const title = ref('فروشگاه اینترنتی شاواز | قوانین - حقوق اداره کار')
        const description = ref("بخش قوانی شاواز ، حقوق اداره کار شاواز")

        useHead({
            title,
            meta: [{
                name: 'description',
                content: description
            }]
        })
    },
}
</script>

<style>
@import '~/assets/scss/views/rules.scss';
</style>
