<template lang="">
    <v-main class="v-rules">
        <v-container>
            <v-row>
                <v-col cols="12" md="3">
                    <generalRulesMenu />
                </v-col>
                <v-col cols="12" md="9">
                    <generalRulesContent :content="content" title="بازگشت محصول"/>
                </v-col>
            </v-row>
        </v-container>
    </v-main>
</template>
<script>
export default {
    data() {
        return {
            content:'کاربر موظف است در هنگام دریافت کالا از پیک شاواز یا مامور پست بسته خود را از نظر ظاهری بررسی نماید و در صورت وجود آسیب فیزیکی از دریافت بسته خودداری نماید. در صورت دریافت بسته های پستی که دارای مشکل ظاهری هستند, بررسی تنها با داشتن صورت جلسه ی بسته ی پستی امکان پذیر خواهد بود.<br>به دلیل مقررات بهداشت امکان انصراف از خرید و بازگشت کالا به دلایل سلیقه ای وجود ندارد. کالا تنها در صورتی به دلیل عدم تطابق با سلیقه مشتری و انصراف از خرید پس گرفته می شود که پلمپ داشته باشد و این پلمپ باز نشده باشد، در غیر این صورت امکان بازگشت کالا وجود ندارد. در صورتی که کالا در فرآیند ارسال خراب شده یا مشکلی داشته باشد تا 7 روز بعد از تحویل، باز پس گرفته شده و پس از بررسی و احراز مشکل معدوم می شود. برای استفاده از ضمانت بازگشت کالا لازم است حداکثر تا 7 روز پس از دریافت بسته، درخواست مرجوع کردن کالا را در پروفایل خود ثبت نمایید. یا امورمشتریان شاواز تماس بگیرید و موضوع را اطلاع دهید .<br>برای بازگرداندن کالا لازم است ابتدا موضوع را به امور مشتریان شاوازاطلاع دهید. برای تماس یکی از این دو رو ش را انتخاب کنید:1- با شماره <span class="ltr number-font">02191032343 </span>با امور مشتریان شاوازتماس بگیرید 2- در اکانت کاربری خود، در بخش خریدهای من وارد شده و به امور مشتریان تیکت بزنید و شماره فاکتور و علت بازگشت کالا ارسال بفرمایید تا امور مشتریان درخواست شما را بررسی کرده و طی یک روز کاری با شما تماس بگیرند. در این تماس، ممکن است از شما خواسته شود از محصول یا بسته خود که قصد بازگرداندن آن را دارید عکس ارسال نمایید و کمی تأمل نمایید تا مشکل شما بررسی شود. در صورت تأیید مرجوعی کالا، زمان و روش بازگرداندن آن با شما هماهنگ می شود. بعد از تأیید و هماهنگی برای بازگرداندن کالا، لطفا مشخصات خود شامل شماره فاکتور، شماره همراه و نام خود را به همراه محصول از روش های اعلام شده توسط امورمشتریان برای ما ارسال کنید.<br>هرگونه دخل و تصرف در کالا، اعم از استفاده، مخدوش کردن یا باز کردن پلمپ، پاره شدن لیبل مانع از امکان انصراف از خرید یا بازگشت کالا می‌شود. لذا قبل از باز کردن و استفاده از محصول به تاریخ انقضا، تطابق کالا با سفارش و سایر موارد توجه فرمایید.<br>پس از دریافت کالا توسط انبار، بخش کنترل کیفیت مورد اعلام شده توسط کاربر را مورد بررسی قرار می‌دهد در صورت صحت کالا و مشکل اعلام شده, کالا تعویض یا وجه آن عودت داده می‌شود در غیر این صورت کالا مجددا برای مشتری ارسال خواهد شد.<br>بازگشت کالا صرفا با اطلاع رسانی به امورمشتریان و تایید ایشان امکان پذیر می باشد, توجه داشته باشید هر گونه هزینه و تبعات در صورت بازگشت کالا بدون اطلاع رسانی بر عهده ی کاربر می باشد.<br>روند دریافت کالای مرجوعی به این صورت است که کاربر باید از طریق پست بسته را برای شاواز ارسال نماید. هزینه ی بازگشت کالاهایی که کاربر مایل به مرجوعی سلیقه ای آنها می باشد, بر عهده ی خود کاربر می باشد و در باقی موارد پس از ارسال کد رهگیری پستی، هزینه پستی به حساب کاربر واریز می شود. تعویض کالای مرجوعی تنها در صورتی امکان پذیر است که تامین کننده یا فرو شنده کالا را موجود داشته باشد یا کالا در انبار مرکزی شاواز موجود باشد. در غیر این صورت پس از مرجوع شدن کالا, هزینه برگشت داده می شود.'
        }
    },

    setup() {
        const title = ref('فروشگاه اینترنتی شاواز | قوانین - بازگشت محصول')
        const description = ref("بخش قوانی شاواز ، بازگشت محصول شاواز")

        useHead({
            title,
            meta: [{
                name: 'description',
                content: description
            }]
        })
    },
}
</script>
<style>
@import '~/assets/scss/views/rules.scss';
</style>
